app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function verClientes(): string
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->findAll();

INSERT INTO `clientes` (`nombre`, `apellido`, `fecha_nacimiento`, `fecha_sucripcion`, `correo_electronico`, `telefono_movil`) VALUES ('Axel', 'Colíndres', '', '', 'axel@gmail.com', '24015465')
---
    public function guardarCliente()
    {
        $clientes = new ClientesModel();
        $datos = [
            'cliente_id' => $this->request->getPost('txtClienteID'),
            'nombre' => $this->request->getPost('txtNombre'),
            'apellido' => $this->request->getPost('txtApellido'),
            'fecha_nacimiento' => $this->request->getPost('txtFechaNac'),
            'fecha_sucripcion' => $this->request->getPost('txtFechaSub'),
            'correo_electronico' => $this->request->getPost('txtCorreo'),
            'telefono_movil' => $this->request->getPost('txtTelefono')
        ];
        print_r($datos);
        $clientes->insert($datos);

DELETE FROM `clientes`
WHERE `cliente_id` IN ('8')
---
    public function eliminarCliente($cod=null)
    {
        $clientes = New ClientesModel();
        $clientes->delete(['cliente_id'=>$cod]);

SELECT *
FROM `clientes`
WHERE `cliente_id` = '9'
 LIMIT 1
---
    public function actualizarCliente($cod=null)
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where(['cliente_id'=>$cod])->first();